### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.function_profile_async.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profas-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "1.0.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.storage_accounts.azurerm_storage_encryption_scope.lollipop_assertions will be updated in-place
  ~ resource "azurerm_storage_encryption_scope" "lollipop_assertions" {
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnauthsessionst01/encryptionScopes/lollipopassertions01"
      ~ key_vault_key_id                   = "https://io-p-itn-auth-kv-01.vault.azure.net/keys/lollipop-assertions-storage-01/e075a536b0a24d56a864b887e9d562e5" -> "https://io-p-itn-auth-kv-01.vault.azure.net/keys/lollipop-assertions-storage-01"
        name                               = "lollipopassertions01"
        # (3 unchanged attributes hidden)
    }

  # module.iam_kv_ioweb.module.kv_func["b06eaaea-c5e3-4168-8b79-31c11f6c6116"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-ioweb-rg-01|io-p-itn-ioweb-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Grant read access to Key Vault secrets for provided Function Apps"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b06eaaea-c5e3-4168-8b79-31c11f6c6116"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ioweb-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ioweb-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam_kv_ioweb.module.kv_func["b96b65ef-ceb3-4c6c-bbcb-44979c294f5b"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-ioweb-rg-01|io-p-itn-ioweb-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Grant read access to Key Vault secrets for provided Function Apps"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b96b65ef-ceb3-4c6c-bbcb-44979c294f5b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ioweb-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ioweb-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam_kv_ioweb.module.kv_func["io-p-itn-auth-function-web-profile-st"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-ioweb-rg-01|io-p-itn-ioweb-kv-01|reader"] will be destroyed
  # (because module.iam_kv_ioweb.module.kv_func["io-p-itn-auth-function-web-profile-st"].module.key_vault is not in configuration)
  - resource "azurerm_role_assignment" "secrets" {
      - description                            = "Grant read access to Key Vault secrets for provided Function Apps" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ioweb-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ioweb-kv-01/providers/Microsoft.Authorization/roleAssignments/f81705a5-ce58-20b2-c134-7193b4f5a56b" -> null
      - name                                   = "f81705a5-ce58-20b2-c134-7193b4f5a56b" -> null
      - principal_id                           = "b96b65ef-ceb3-4c6c-bbcb-44979c294f5b" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> null
      - role_definition_name                   = "Key Vault Secrets User" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ioweb-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ioweb-kv-01" -> null
        # (3 unchanged attributes hidden)
    }

  # module.iam_kv_ioweb.module.kv_func["io-p-itn-auth-webprof-func-01"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-ioweb-rg-01|io-p-itn-ioweb-kv-01|reader"] will be destroyed
  # (because module.iam_kv_ioweb.module.kv_func["io-p-itn-auth-webprof-func-01"].module.key_vault is not in configuration)
  - resource "azurerm_role_assignment" "secrets" {
      - description                            = "Grant read access to Key Vault secrets for provided Function Apps" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ioweb-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ioweb-kv-01/providers/Microsoft.Authorization/roleAssignments/a3c56c79-2b48-140e-7c51-4c9e13112806" -> null
      - name                                   = "a3c56c79-2b48-140e-7c51-4c9e13112806" -> null
      - principal_id                           = "b06eaaea-c5e3-4168-8b79-31c11f6c6116" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> null
      - role_definition_name                   = "Key Vault Secrets User" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ioweb-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ioweb-kv-01" -> null
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```

</details>
